Config/Documents/РасчетПлатыПоДолгосрочнымДоговорамОбразование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>РасчетПлатыПоДолгосрочнымДоговорамОбразование</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Факультет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособЗаполненияПоПериоду</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Учащиеся</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Учащийся</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Студенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорКонтрагента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачалоПериода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонецПериода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОплаты</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИДСтроки</Name>
							<Comment>Идентификатор строки - для связи с документами "Квитанция на оплату"</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПоДоговору</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Оплачено</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/Documents/РасчетПлатыПоДолгосрочнымДоговорамОбразование/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// См. УправлениеДоступом.ЗаполнитьНаборыЗначенийДоступа.
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	// Логика ограничения:
	// Чтения:     Организация
	// Изменения:  Организация
	
	// Чтение, Изменение: набор №0.
	Строка = Таблица.Добавить();
	Строка.ЗначениеДоступа = Организация;
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоНовый() Тогда
		
		ВалютаДокумента = ОбщегоНазначенияБГУПовтИсп.ПолучитьВалютуРегламентированногоУчета();
		
	КонецЕсли; 
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Для каждого СтрокаТЧ Из Учащиеся Цикл
		
		ПроверитьРеквизитТЧ(СтрокаТЧ, "Контрагент", "Контрагент",, Отказ);
		ПроверитьРеквизитТЧ(СтрокаТЧ, "ДоговорКонтрагента", "Договор контрагента",, Отказ);
		
	    ПроверитьРеквизитТЧ(СтрокаТЧ, "Сумма", "Сумма",, Отказ);
	    ПроверитьРеквизитТЧ(СтрокаТЧ, "НачалоПериода", "Начало периода", "НачалоПериодаСтрокой", Отказ);
		ПроверитьРеквизитТЧ(СтрокаТЧ, "КонецПериода", "Конец периода", "КонецПериодаСтрокой", Отказ);
		ПроверитьРеквизитТЧ(СтрокаТЧ, "ДатаОплаты", "Дата оплаты",, Отказ);
		
	КонецЦикла;
	
	ПроверитьДублиСтрок(Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	МассивИдентификаторовСтрок = Новый Массив;
	
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
		//Если ссылка пустая, значит документ новый, устанавливаем новые идентификаторы всем строкам
		Для Каждого СтрТЧ Из Учащиеся Цикл
			Если НЕ ЗначениеЗаполнено(СтрТЧ.ИДСтроки) Тогда
				СтрТЧ.ИДСтроки = Строка(Новый УникальныйИдентификатор);			
			ИначеЕсли МассивИдентификаторовСтрок.Найти(СтрТЧ.ИДСтроки)<>Неопределено Тогда
				СтрТЧ.ИДСтроки = Строка(Новый УникальныйИдентификатор);
			КонецЕсли;
			МассивИдентификаторовСтрок.Добавить(СтрТЧ.ИДСтроки);
		КонецЦикла;
	Иначе
		//Если ссылка не пустая, нужен анализ идентификаторов строк.
		//Т.к. возможна ситуация, когда строку скопировали, а исходную - удалили.
		//В этом случае нужно ранее присвоенные идентификаторы назначить новым строкам.
		Запрос = Новый Запрос("ВЫБРАТЬ
          |	НачислениеРодительскойПлатыНачисления.НомерСтроки,
          |	НачислениеРодительскойПлатыНачисления.Учащийся КАК Учащийся,
          |	НачислениеРодительскойПлатыНачисления.Контрагент,
          |	НачислениеРодительскойПлатыНачисления.ДоговорКонтрагента,
		  |	НачислениеРодительскойПлатыНачисления.НачалоПериода,
		  |	НачислениеРодительскойПлатыНачисления.КонецПериода,
		  |	НачислениеРодительскойПлатыНачисления.ДатаОплаты,
          |	НачислениеРодительскойПлатыНачисления.ИДСтроки
          |ПОМЕСТИТЬ ТекущиеНачисления
          |ИЗ
          |	&Начисления КАК НачислениеРодительскойПлатыНачисления
          |;
          |
          |////////////////////////////////////////////////////////////////////////////////
          |ВЫБРАТЬ
          |	НачислениеРодительскойПлатыНачисления.НомерСтроки,
          |	НачислениеРодительскойПлатыНачисления.Учащийся КАК Учащийся,
          |	НачислениеРодительскойПлатыНачисления.Контрагент,
          |	НачислениеРодительскойПлатыНачисления.ДоговорКонтрагента,
		  |	НачислениеРодительскойПлатыНачисления.НачалоПериода,
		  |	НачислениеРодительскойПлатыНачисления.КонецПериода,
		  |	НачислениеРодительскойПлатыНачисления.ДатаОплаты,
          |	НачислениеРодительскойПлатыНачисления.ИДСтроки
          |ПОМЕСТИТЬ ДанныеДокумента
          |ИЗ
          |	Документ.РасчетПлатыПоДолгосрочнымДоговорамОбразование.Учащиеся КАК НачислениеРодительскойПлатыНачисления
          |ГДЕ
          |	НачислениеРодительскойПлатыНачисления.Ссылка = &Ссылка
          |;
          |
          |////////////////////////////////////////////////////////////////////////////////
          |ВЫБРАТЬ
          |	ТекущиеНачисления.НомерСтроки,
          |	ТекущиеНачисления.Учащийся,
          |	ТекущиеНачисления.Контрагент,
          |	ТекущиеНачисления.ДоговорКонтрагента,
		  |	ТекущиеНачисления.НачалоПериода,
		  |	ТекущиеНачисления.КонецПериода,
		  |	ТекущиеНачисления.ДатаОплаты,
          |	ТекущиеНачисления.ИДСтроки,
          |	ДанныеДокумента.НомерСтроки КАК НомерСтрокиИсх,
          |	ДанныеДокумента.ИДСтроки КАК ИДСтрокиИсх,
          |	ДанныеДокумента.Учащийся КАК УчащийсяИсх,
          |	ДанныеДокумента.Контрагент КАК КонтрагентИсх,
          |	ДанныеДокумента.ДоговорКонтрагента КАК ДоговорКонтрагентаИсх,
		  |	ДанныеДокумента.НачалоПериода КАК НачалоПериодаИсх,
		  |	ДанныеДокумента.КонецПериода КАК КонецПериодаИсх,
		  |	ДанныеДокумента.ДатаОплаты КАК ДатаОплатыИсх
          |ПОМЕСТИТЬ СвязанныеТаблицы
          |ИЗ
          |	ТекущиеНачисления КАК ТекущиеНачисления
          |		ПОЛНОЕ СОЕДИНЕНИЕ ДанныеДокумента КАК ДанныеДокумента
          |		ПО ТекущиеНачисления.Учащийся = ДанныеДокумента.Учащийся
          |			И ТекущиеНачисления.Контрагент = ДанныеДокумента.Контрагент
          |			И ТекущиеНачисления.ДоговорКонтрагента = ДанныеДокумента.ДоговорКонтрагента
		  |			И ТекущиеНачисления.НачалоПериода = ДанныеДокумента.НачалоПериода
		  |			И ТекущиеНачисления.КонецПериода = ДанныеДокумента.КонецПериода
		  |			И ТекущиеНачисления.ДатаОплаты = ДанныеДокумента.ДатаОплаты
          |			И ТекущиеНачисления.ИДСтроки = ДанныеДокумента.ИДСтроки
          |;
          |
          |////////////////////////////////////////////////////////////////////////////////
          |ВЫБРАТЬ
          |	СвязанныеТаблицы.НомерСтрокиИсх,
          |	СвязанныеТаблицы.ИДСтрокиИсх,
          |	СвязанныеТаблицы.УчащийсяИсх,
          |	СвязанныеТаблицы.КонтрагентИсх,
          |	СвязанныеТаблицы.ДоговорКонтрагентаИсх,
		  |	СвязанныеТаблицы.НачалоПериодаИсх,
		  |	СвязанныеТаблицы.КонецПериодаИсх,
		  |	СвязанныеТаблицы.ДатаОплатыИсх
          |ПОМЕСТИТЬ СвободныеИдентификаторы
          |ИЗ
          |	СвязанныеТаблицы КАК СвязанныеТаблицы
          |ГДЕ
          |	СвязанныеТаблицы.НомерСтроки ЕСТЬ NULL 
          |;
          |
          |////////////////////////////////////////////////////////////////////////////////
          |ВЫБРАТЬ
          |	СвязанныеТаблицы.НомерСтроки КАК НомерСтроки,
          |	СвободныеИдентификаторы.ИДСтрокиИсх
          |ИЗ
          |	СвязанныеТаблицы КАК СвязанныеТаблицы
          |		ЛЕВОЕ СОЕДИНЕНИЕ СвободныеИдентификаторы КАК СвободныеИдентификаторы
          |		ПО СвязанныеТаблицы.Учащийся = СвободныеИдентификаторы.УчащийсяИсх
          |			И СвязанныеТаблицы.Контрагент = СвободныеИдентификаторы.КонтрагентИсх
          |			И СвязанныеТаблицы.ДоговорКонтрагента = СвободныеИдентификаторы.ДоговорКонтрагентаИсх
		  |			И СвязанныеТаблицы.НачалоПериода = СвободныеИдентификаторы.НачалоПериодаИсх
		  |			И СвязанныеТаблицы.КонецПериода = СвободныеИдентификаторы.КонецПериодаИсх
		  |			И СвязанныеТаблицы.ДатаОплаты = СвободныеИдентификаторы.ДатаОплатыИсх
          |ГДЕ
          |	СвязанныеТаблицы.НомерСтрокиИсх ЕСТЬ NULL
		  |	И НЕ СвободныеИдентификаторы.ИДСтрокиИсх ЕСТЬ NULL
          |
          |УПОРЯДОЧИТЬ ПО
          |	НомерСтроки
          |ИТОГИ ПО
          |	НомерСтроки");
							  
		Запрос.УстановитьПараметр("Начисления",Учащиеся.Выгрузить());
		Запрос.УстановитьПараметр("Ссылка",Ссылка);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Для Каждого СтрТЧ Из Учащиеся Цикл
			Если НЕ ЗначениеЗаполнено(СтрТЧ.ИДСтроки) Тогда
				Если Выборка.НайтиСледующий(Новый Структура("НомерСтроки",СтрТЧ.НомерСтроки)) Тогда
					ВыборкаДетальная = Выборка.Выбрать();
					Пока ВыборкаДетальная.Следующий() Цикл
						Если МассивИдентификаторовСтрок.Найти(ВыборкаДетальная.ИДСтрокиИсх) = Неопределено Тогда
							СтрТЧ.ИДСтроки = ВыборкаДетальная.ИДСтрокиИсх;						
							Прервать;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				Если НЕ ЗначениеЗаполнено(СтрТЧ.ИДСтроки) Тогда							
					СтрТЧ.ИДСтроки = Строка(Новый УникальныйИдентификатор);
				КонецЕсли;
			ИначеЕсли МассивИдентификаторовСтрок.Найти(СтрТЧ.ИДСтроки)<>Неопределено Тогда
				СтрТЧ.ИДСтроки = Строка(Новый УникальныйИдентификатор);
			КонецЕсли;
			МассивИдентификаторовСтрок.Добавить(СтрТЧ.ИДСтроки);
		КонецЦикла;
	КонецЕсли;
	
	СуммаДокумента = Учащиеся.Итог("Сумма");

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьДублиСтрок(Отказ)
	
	ШаблонТекстДублей = НСтр("ru = 'Учащийся ""%1"" с договором ""%2"" указан в списке более одного раза для периода %3 - %4 и даты оплаты %5.'");
		
	Запрос = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ
	               |	Учащиеся.НомерСтроки,
	               |	Учащиеся.Учащийся,
				   |	Учащиеся.Контрагент,
				   |	Учащиеся.ДоговорКонтрагента,
				   |	Учащиеся.НачалоПериода,
				   |	Учащиеся.КонецПериода,
	               |	Учащиеся.ДатаОплаты
	               |ПОМЕСТИТЬ ТаблицаУчащихся
	               |ИЗ
	               |	&Учащиеся КАК Учащиеся
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	МАКСИМУМ(ТаблицаУчащихся.НомерСтроки) КАК НомерСтроки,
	               |	ТаблицаУчащихся.Учащийся,
				   |	ТаблицаУчащихся.Контрагент,
				   |	ТаблицаУчащихся.ДоговорКонтрагента,
				   |	ТаблицаУчащихся.НачалоПериода,
				   |	ТаблицаУчащихся.КонецПериода,
	               |	ТаблицаУчащихся.ДатаОплаты
	               |ИЗ
	               |	ТаблицаУчащихся КАК ТаблицаУчащихся
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТаблицаУчащихся.Учащийся,
				   |	ТаблицаУчащихся.Контрагент,
				   |	ТаблицаУчащихся.ДоговорКонтрагента,
	               |	ТаблицаУчащихся.НачалоПериода,
				   |	ТаблицаУчащихся.КонецПериода,
				   |	ТаблицаУчащихся.ДатаОплаты
	               |
	               |ИМЕЮЩИЕ
	               |	КОЛИЧЕСТВО(*) > 1";
	Запрос.Текст = ТекстЗапроса; 
	Запрос.УстановитьПараметр("Учащиеся", Учащиеся.Выгрузить(, "НомерСтроки, Учащийся, Контрагент, ДоговорКонтрагента, НачалоПериода, КонецПериода, ДатаОплаты")) ;
	
	ВыборкаДублей = Запрос.Выполнить().Выбрать();
	Пока ВыборкаДублей.Следующий() Цикл
		
		Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ШаблонТекстДублей,
			ВыборкаДублей.Учащийся,
			ВыборкаДублей.ДоговорКонтрагента,
			Формат(ВыборкаДублей.НачалоПериода, "ДЛФ=DD"),
			Формат(ВыборкаДублей.КонецПериода, "ДЛФ=DD"),
			Формат(ВыборкаДублей.ДатаОплаты, "ДЛФ=DD")
		);
		Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Учащиеся", ВыборкаДублей.НомерСтроки, "Учащийся");
		ОбщегоНазначения.СообщитьПользователю(Текст, ЭтотОбъект, Поле,, Отказ);
		
	КонецЦикла; 
	
КонецПроцедуры

Процедура ПроверитьРеквизитТЧ(СтрокаТЧ, ИмяРеквизита, Представление, ИмяРеквизитаПривязки = Неопределено, Отказ)
	
	Если НЕ ЗначениеЗаполнено(СтрокаТЧ[ИмяРеквизита]) Тогда
				
		ТекстОшибки = НСтр("ru='Не заполнена колонка """ + Представление + """ в строке " + СтрокаТЧ.НомерСтроки + " списка ""Учащиеся""'");
		Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Учащиеся", СтрокаТЧ.НомерСтроки, ?(ИмяРеквизитаПривязки = Неопределено, ИмяРеквизита, ИмяРеквизитаПривязки));
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, Поле,, Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
